{
	"name": "Персональные порталы",
	"icon": "dimdungeons:item_key_build",
	"category": "dimdungeons:portals",
	"sortnum": 10,
	"advancement": "dimdungeons:dungeons/enter_personal_space",
	"pages": [
		{
			"type": "text",
			"text": "Теперь, когда вы чувствуете себя комфортно в своем личном межпространстве, пришло время узнать о том, как установить ограничения на тех, кто может следовать за вами через ваш портал. Настройка доступа к вашему измерению выполняется изнутри с помощью одного из пяти предметов на золотом портале у входа. (Предметы никогда не расходуются.) Эти предметы будут рассмотрены на следующих пяти страницах."
		},
		{
			"type": "spotlight",
			"item": "minecraft:book",
			"text": "Использование Книги на вашем портале покажет вам список ваших текущих гостей, а также будет ли этот список в режиме белого списка или черного списка."
		},
		{
			"type": "spotlight",
			"item": "minecraft:white_dye",
			"text": "Использование Белой Краски на вашем портале переключит его в режим белого списка. Список настроенных имен будет рассматриваться как друзья, и никто другой не будет допущен."
		},
		{
			"type": "spotlight",
			"item": "minecraft:black_dye",
			"text": "Использование Черной Краски на вашем портале переключит его в режим черного списка. Список настроенных имен будет рассматриваться как список банов, и все, КРОМЕ именованных игроков, будут допущены."
		},
		{
			"type": "spotlight",
			"item": "minecraft:paper",
			"text": "Сначала назовите Бумагу на наковале именем другого игрока. Затем используйте бумагу на вашем портале, чтобы добавить их в гибкий список гостей. Используйте Бумагу снова, чтобы удалить имя этого игрока. Список может быть как белым, так и черным списком."
		},
		{
			"type": "spotlight",
			"item": "minecraft:grindstone",
			"text": "Использование Мозаичного Камня на вашем портале удалит все настроенные имена на нем."
		},
		{
			"type": "text",
			"text": "Есть несколько ограничений этой системы безопасности. Прежде всего и наиболее важно то, что она контролирует только, кто может войти. Разрешения на строительство не реализованы. (Хотя некоторые серверы могут реализовать это отдельно.) Во-вторых, существует несколько способов, которыми игроки могут обойти разрешения и получить доступ, независимо от того, как настроен портал:"
		},
		{
			"type": "text",
			"text": "$(li)Владелец измерения всегда имеет право на вход. $(li)Игроки в режиме творчества всегда имеют право на вход. $(li)Администратор сервера может установить disablePersonalDimSecurity= true в конфигурации сервера. $(li)Разрешения проверяются только обычным порталом с отверстием для ключа. Использование других способов телепортации приведет к обходу проверок."
		}
	]
}
